pavlio12/KRP_Project/Ux_Device_HID_CDC_ACM/Ux_Device_HID_CDC_ACM.ioc
RCC.PLL2_VCI_Range-AdvancedSettings=RCC_PLL2VCIRANGE_0
RCC.PLL2_VCO_SEL-AdvancedSettings=RCC_PLL2VCOMEDIUM
RCC.PLL3FRACN=0
RCC.PLL3_VCO_SEL-AdvancedSettings=RCC_PLL3VCOMEDIUM
RCC.PLLDSIVCOFreq_Value=1000000000
RCC.PLLFRACN=0
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
RCC.PWR_Regulator_Voltage_Scale=PWR_REGULATOR_VOLTAGE_SCALE1
RCC.ProductRev=revV
RCC.QSPIFreq_Value=200000000
RCC.RNGFreq_Value=48000000
RCC.RTCFreq_Value=32000
RCC.SAI1Freq_Value=400000000
RCC.SAI23Freq_Value=400000000
RCC.SAI4AFreq_Value=400000000
RCC.SAI4BFreq_Value=400000000
RCC.SDMMCFreq_Value=400000000
RCC.SPDIFRXFreq_Value=400000000
RCC.SPI123Freq_Value=400000000
RCC.SPI45Freq_Value=100000000
RCC.SPI6Freq_Value=100000000
RCC.SWPMI1Freq_Value=100000000
RCC.SYSCLKFreq_VALUE=400000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.SupplySource=PWR_DIRECT_SMPS_SUPPLY
RCC.Tim1OutputFreq_Value=200000000
RCC.Tim2OutputFreq_Value=200000000
RCC.TraceFreq_Value=64000000
RCC.USART16CLockSelection=RCC_USART16CLKSOURCE_PLL2
RCC.USART16Freq_Value=100000000
RCC.USART234578Freq_Value=100000000
RCC.USBCLockSelection=RCC_USBCLKSOURCE_PLL3
RCC.USBFreq_Value=48000000
RCC.VCO1OutputFreq_Value=800000000
RCC.VCO2OutputFreq_Value=800000000
RCC.VCO3OutputFreq_Value=240000000
RCC.VCOInput1Freq_Value=5000000
RCC.VCOInput2Freq_Value=5000000
RCC.VCOInput3Freq_Value=1000000
RCC.VDD_VALUE=3.3
SH.GPXTI13.0=GPIO_EXTI13
SH.GPXTI13.ConfNb=1
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_IsAnAzureRtosMw=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.IPParameters=ThreadXCcRTOSJjThreadXJjCore,TX_DISABLE_PREEMPTION_THRESHOLD,USBXCcUSBJjUSBXJjCoreSystem,USBXCcUSBJjUSBXJjCoreUtilities,UX_SLAVE_REQUEST_DATA_MAX_LENGTH,UX_MAX_SLAVE_CLASS_DRIVER,USBXCcUSBJjUSBXJjUXOoDeviceOoControllers,USBXCcUSBJjUSBXJjUXOoDeviceOoCoreStack,UX_DEVICE_SIDE_ONLY,UX_DEVICE_APP_MEM_POOL_SIZE,USBX_DEVICE_SYS_SIZE,USBD_PID,USBD_PRODUCT_STRING,USBD_SERIAL_NUMBER,USBXCcUSBJjUSBXJjUXOoDeviceOoClassOoHID,USBXCcUSBJjUSBXJjUXOoDeviceOoClassOoHIDOoCore,USBD_HID_EPIN_ADDR,USBXCcUSBJjUSBXJjUXOoDeviceOoClassOoHIDOoMouse,USBD_HID_MOUSE_EPIN_ADDR,USBXCcUSBJjUSBXJjUXOoDeviceOoClassOoCDCOoACM,USBD_CDCACM_EPINCMD_ADDR,USBD_CDCACM_EPIN_ADDR
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.RTOSJjThreadX_Checked=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.TX_DISABLE_PREEMPTION_THRESHOLD=1
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.ThreadXCcRTOSJjThreadXJjCore=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBD_CDCACM_EPINCMD_ADDR=2
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBD_CDCACM_EPIN_ADDR=1
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBD_HID_EPIN_ADDR=3
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBD_HID_MOUSE_EPIN_ADDR=3
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBD_PID=0x5750
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBD_PRODUCT_STRING=STM32 Device HID CDC_ACM
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBD_SERIAL_NUMBER=COMP001
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBJjUSBX_Checked=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBXCcUSBJjUSBXJjCoreSystem=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBXCcUSBJjUSBXJjCoreUtilities=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBXCcUSBJjUSBXJjUXOoDeviceOoClassOoCDCOoACM=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBXCcUSBJjUSBXJjUXOoDeviceOoClassOoHID=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBXCcUSBJjUSBXJjUXOoDeviceOoClassOoHIDOoCore=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBXCcUSBJjUSBXJjUXOoDeviceOoClassOoHIDOoMouse=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBXCcUSBJjUSBXJjUXOoDeviceOoControllers=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBXCcUSBJjUSBXJjUXOoDeviceOoCoreStack=true
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.USBX_DEVICE_SYS_SIZE=12*1024
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.UX_DEVICE_APP_MEM_POOL_SIZE=17 * 1024
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.UX_DEVICE_SIDE_ONLY=1
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.UX_MAX_SLAVE_CLASS_DRIVER=2
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7.UX_SLAVE_REQUEST_DATA_MAX_LENGTH=512
STMicroelectronics.X-CUBE-AZRTOS-H7.3.4.0_M7_SwParameter=USBXCcUSBJjUSBXJjUXOoDeviceOoClassOoHIDOoCore\:true;USBXCcUSBJjUSBXJjUXOoDeviceOoControllers\:true;USBXCcUSBJjUSBXJjCoreSystem\:true;USBXCcUSBJjUSBXJjUXOoDeviceOoClassOoHIDOoMouse\:true;ThreadXCcRTOSJjThreadXJjCore\:true;USBXCcUSBJjUSBXJjUXOoDeviceOoCoreStack\:true;USBXCcUSBJjUSBXJjUXOoDeviceOoClassOoCDCOoACM\:true;
SYS.userName=SYS_M7
USART1.DMADisableonRxErrorParam=ADVFEATURE_DMA_ENABLEONRXERROR
USART1.IPParameters=OverrunDisableParam,DMADisableonRxErrorParam,VirtualMode-Asynchronous
USART1.OverrunDisableParam=ADVFEATURE_OVERRUN_ENABLE
USART1.VirtualMode-Asynchronous=VM_ASYNC
USB_OTG_HS.IPParameters=VirtualMode-Device_HS
USB_OTG_HS.VirtualMode-Device_HS=Device_HS
VP_RCC_USB.Mode=USB_HS
VP_RCC_USB.Signal=RCC_USB
VP_STMicroelectronics.X-CUBE-AZRTOS-H7_M7_VS_RTOSJjThreadX_6.4.0_3.4.0.Mode=RTOSJjThreadX
VP_STMicroelectronics.X-CUBE-AZRTOS-H7_M7_VS_RTOSJjThreadX_6.4.0_3.4.0.Signal=STMicroelectronics.X-CUBE-AZRTOS-H7_M7_VS_RTOSJjThreadX_6.4.0_3.4.0
VP_STMicroelectronics.X-CUBE-AZRTOS-H7_M7_VS_USBJjUSBX_6.4.0_3.4.0.Mode=USBJjUSBX
VP_STMicroelectronics.X-CUBE-AZRTOS-H7_M7_VS_USBJjUSBX_6.4.0_3.4.0.Signal=STMicroelectronics.X-CUBE-AZRTOS-H7_M7_VS_USBJjUSBX_6.4.0_3.4.0
VP_SYS_M4_VS_Systick.Mode=SysTick
VP_SYS_M4_VS_Systick.Signal=SYS_M4_VS_Systick
VP_SYS_VS_tim6.Mode=TIM6
VP_SYS_VS_tim6.Signal=SYS_VS_tim6
board=STM32H747I-DISCO
ProjectManager.Example=Ux_Device_HID_CDC_ACM
ProjectManager.ExampleSource=MxCubeExpansion
boardIOC=true
